app/views/lists/index.html.erb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`list_id` = 1
---

	<% list.tasks.each do |task| %>