app/views/lists/show.html.erb

<h3>Tasks</h3>
<%@list.tasks.each do |task| %>
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`list_id` = 1