app/views/lists/user_lists.html.erb


                <% list.tasks.each do |task| %>
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`list_id` = 1