app/views/watches/index.html.erb

SELECT `lists`.* FROM `lists` WHERE `lists`.`watch_id` = 1 LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`list_id` = 1
---

		        <% watch.list.tasks.each do |task| %>