app/views/watches/user_watches.html.erb


		        <% watch.list.tasks.each do |task| %>
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`list_id` = 1