app/controllers/home_controller.rb

	def index
		@lists_public = List.where("user_id <> ?",current_user).public
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 0