app/controllers/lists_controller.rb

	def index
		@lists = List.where(:user_id => "<> #{current_user}").public
---
SELECT `lists`.* FROM `lists` WHERE (status 'public' AND user_id <> '1' )