app/controllers/lists_controller.rb

INSERT INTO `lists` (`created_at`, `name`, `status`, `updated_at`, `user_id`) VALUES ('2012-06-13 14:09:17', 'list test', 'public', '2012-06-13 14:09:17', 1)
---
	def create
		@list = List.new(params[:list])
		@list.user=(current_user)
		@list.save

SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 3 AND `lists`.`id` = 1 LIMIT 1
---
	def edit
		@list = current_user.lists.find(params[:id])

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
UPDATE `lists` SET `name` = 'list test edited', `updated_at` = '2012-06-13 17:16:31' WHERE `lists`.`id` = 1
---
	def update
		@list = List.find(params[:id])
		@list.update_attributes(params[:list])

SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 3 AND `lists`.`id` = 5 LIMIT 1
---
	def show
		@list = current_user.lists.find(params[:id])

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 9 LIMIT 1
DELETE FROM `lists` WHERE `lists`.`id` = 9
---
	def destroy
		@list = current_user.lists.find(params[:id])
		@list.destroy