app/controllers/watches_controller.rb

	def destroy
		list = List.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1