app/controllers/watches_controller.rb

SELECT `lists`.* FROM `lists` WHERE `lists`.`watch_id` = 1 LIMIT 1
SELECT `watches`.* FROM `watches`
---
	def index
		@watches = Watch.includes(:list)

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
INSERT INTO `watches` (`created_at`, `list_id`, `updated_at`, `user_id`) VALUES ('2012-06-13 21:20:07', 1, '2012-06-13 21:20:07', 1)
---
	def add
		@watch = Watch.new
		@watch.list_id=(List.find(params[:id]).id)
		@watch.user_id=(current_user.id)
		if@watch.save