app/views/users/lists/index.html.erb


                <% list.tasks.each do |task| %>
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`list_id` = 4