app/controllers/users/lists_controller.rb

INSERT INTO `lists` (`created_at`, `name`, `status`, `updated_at`, `user_id`) VALUES ('2012-07-16 15:18:53', 'testsetets', 'public', '2012-07-16 15:18:53', 3)
---
	def create
		@list = List.new(params[:list])
		@list.user=(current_user)
		@list.save